balazsgrill/modembed/res/Devices/dsPIC30/PIC24F16KL402.PIC
      <edc:DCRDef edc:access="--------nnnnnnnn" edc:cname="FWDT" edc:default="0xffdf" edc:desc="" edc:impl="0xff" edc:name="FWDT" edc:nzwidth="16" edc:unimplval="0" edc:unused="0" edc:useinchecksum="0x00ff">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:AdjustPoint edc:offset="0"/>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="WDTPS" edc:desc="Watchdog Timer Postscale Select bits" edc:mask="0xf" edc:name="WDTPS" edc:nzwidth="4">
              <edc:DCRFieldSemantic edc:cname="PS32768" edc:desc="1:32768" edc:when="(field &amp; 0xf) == 0xF"/>
              <edc:DCRFieldSemantic edc:cname="PS16384" edc:desc="1:16384" edc:when="(field &amp; 0xf) == 0xE"/>
              <edc:DCRFieldSemantic edc:cname="PS8192" edc:desc="1:8192" edc:when="(field &amp; 0xf) == 0xD"/>
              <edc:DCRFieldSemantic edc:cname="PS4096" edc:desc="1:4096" edc:when="(field &amp; 0xf) == 0xC"/>
              <edc:DCRFieldSemantic edc:cname="PS2048" edc:desc="1:2048" edc:when="(field &amp; 0xf) == 0xB"/>
              <edc:DCRFieldSemantic edc:cname="PS1024" edc:desc="1:1024" edc:when="(field &amp; 0xf) == 0xA"/>
              <edc:DCRFieldSemantic edc:cname="PS512" edc:desc="1:512" edc:when="(field &amp; 0xf) == 0x9"/>
              <edc:DCRFieldSemantic edc:cname="PS256" edc:desc="1:256" edc:when="(field &amp; 0xf) == 0x8"/>
              <edc:DCRFieldSemantic edc:cname="PS128" edc:desc="1:128" edc:when="(field &amp; 0xf) == 0x7"/>
              <edc:DCRFieldSemantic edc:cname="PS64" edc:desc="1:64" edc:when="(field &amp; 0xf) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="PS32" edc:desc="1:32" edc:when="(field &amp; 0xf) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="PS16" edc:desc="1:16" edc:when="(field &amp; 0xf) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="PS8" edc:desc="1:8" edc:when="(field &amp; 0xf) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="PS4" edc:desc="1:4" edc:when="(field &amp; 0xf) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="PS2" edc:desc="1:2" edc:when="(field &amp; 0xf) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="PS1" edc:desc="1:1" edc:when="(field &amp; 0xf) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="FWPSA" edc:desc="WDT Prescaler bit" edc:mask="0x1" edc:name="FWPSA" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="PR128" edc:desc="WDT prescaler ratio of 1:128" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="PR32" edc:desc="WDT prescaler ratio of 1:32" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="FWDTEN" edc:desc="Watchdog Timer Enable bits" edc:mask="0x5" edc:name="FWTEN0" edc:nzwidth="3">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="WDT disabled in hardware; SWDTEN bit disabled" edc:when="(field &amp; 0x5) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="NOSLP" edc:desc="WDT enabled while device is active; SWDTEN bit disabled" edc:when="(field &amp; 0x5) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="SWON" edc:desc="WDT controlled with SWDTEN bit setting" edc:when="(field &amp; 0x5) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="WDT enabled in hardware" edc:when="(field &amp; 0x5) == 0x5"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="-2"/>
            <edc:DCRFieldDef edc:cname="WINDIS" edc:desc="Windowed Watchdog Timer Disable bit" edc:mask="0x1" edc:name="WINDIS" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Standard WDT selected (windowed WDT disabled)" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Windowed WDT enabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="--------nnnnn-nn" edc:cname="FPOR" edc:default="0xffff" edc:desc="" edc:impl="0xfb" edc:name="FPOR" edc:nzwidth="16" edc:unimplval="0" edc:unused="0" edc:useinchecksum="0x00fb">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="BOREN" edc:desc="Brown-out Reset Enable bits" edc:mask="0x3" edc:name="BOREN" edc:nzwidth="2">
              <edc:DCRFieldSemantic edc:cname="BOR3" edc:desc="Enabled in hardware; SBOREN bit disabled" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="BOR2" edc:desc="Enabled only while device is active; SBOREN bit disabled" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="BOR1" edc:desc="Brown-out Rest controlled by SBOREN bit" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="BOR0" edc:desc="Brown-out Reset disabled in hardware; SBOREN bit disabled" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:DCRFieldDef edc:cname="PWRTEN" edc:desc="Power-up Timer Enable" edc:mask="0x1" edc:name="PWRTEN" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="PWRT disabled" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="PWRT enabled" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="I2C1SEL" edc:desc="Alternate I2C1 Pin Mapping bit" edc:mask="0x1" edc:name="I2C1SEL" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="PRI" edc:desc="Default SCL1/SDA1 Pins for I2C1" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="SEC" edc:desc="Alternate ASCL1/ASDA1 Pins for I2C1" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="BORV" edc:desc="Brown-out Reset Voltage bits" edc:mask="0x3" edc:name="BORV" edc:nzwidth="2">
              <edc:DCRFieldSemantic edc:cname="V18" edc:desc="Brown-out Reset at 1.8V" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="V27" edc:desc="Brown-out Reset at 2.7V" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="V30" edc:desc="Brown-out Reset at 3.0V" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="LPBOR" edc:desc="Low-power Brown-Out Reset occurs around 2.0V" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="MCLRE" edc:desc="MCLR Pin Enable bit" edc:mask="0x1" edc:name="MCLRE" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="RA5 input disabled; MCLR enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="RA5 input enabled; MCLR disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="--------n-----nn" edc:cname="FICD" edc:default="0xffff" edc:desc="" edc:impl="0x83" edc:name="FICD" edc:nzwidth="16" edc:unimplval="0" edc:unused="0" edc:useinchecksum="0x83">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="ICS" edc:desc="ICD Pin Placement Select" edc:mask="0x3" edc:name="ICS" edc:nzwidth="2">
              <edc:DCRFieldSemantic edc:cname="PGx1" edc:desc="EMUC/EMUD share PGC1/PGD1" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="PGx2" edc:desc="EMUC/EMUD share PGC2/PGD2" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="PGx3" edc:desc="EMUC/EMUD share PGC3/PGD3" edc:when="(field &amp; 0x3) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:DCRFieldDef edc:cname="DEBUG" edc:desc="Background Debugger Enable bit" edc:ishidden="true" edc:mask="0x1" edc:name="DEBUG" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Background debugger disabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Background debugger functions enabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
    </edc:ConfigFuseSector>
  </edc:ProgramSpace>
  <edc:DataSpace edc:xbeginaddr="0x800" edc:xendaddr="0xc00">
    <edc:RegardlessOfMode>
      <edc:SFRDataSector edc:beginaddr="0x0" edc:endaddr="0x800" edc:regionid="sfrs">
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="WREG0" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="WREG0" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="WREG0" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="WREG0" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="WREG1" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="WREG1" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="WREG1" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="WREG1" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Integer"/>
        </edc:SFRDef>
